## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # argocd_project.cinema will be created
+   resource "argocd_project" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "environment" = "dev"
            }
+           name             = "cinema"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           description  = "Cinema"
+           source_repos = [
+               "https://github.com/autotune/microservices-docker-go-mongodb-tf",
            ]

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }
+           destination {
+               namespace = "cinema"
+               server    = "https://kubernetes.default.svc"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
